# HasLeader Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AlignmentStationLabelSetOptions..::..HasLeader Property
AlignmentStationLabelSetOptions Class See Also
---
Specifies if the label will have a leader. The default value is true.
**Namespace:** Autodesk.Revit.DB.Infrastructure**Assembly:** Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021.1
# Syntax
C#
---
```text
public bool HasLeader { get; set; }
```

Visual Basic
---
```text
Public Property HasLeader As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool HasLeader {
	bool get ();
	void set (bool value);
}
```

# See Also
AlignmentStationLabelSetOptions Class
Autodesk.Revit.DB.Infrastructure Namespace